app/Models/Admin_model.php

  public function get_admin_user_details($id)
    {
         $query = $this->db->table('super_admins')->getWhere(['id' => $id]);
---
SELECT *
FROM `super_admins`
WHERE `id` = '69'

  public function update_admin_account_details($id,$data)
  {
        $builder = $this->db->table("super_admins");
        $builder->where('id',$id);
        return $builder->update($data);
---
UPDATE `super_admins` SET `current_wallet` = 98562
WHERE `id` = '69'

    public function get_player_user_details($user_id)
    {
        $query = $this->db->table('super_admins')->getWhere(['id' => $user_id]);
---
SELECT *
FROM `super_admins`
WHERE `id` = '70'