app/Models/Login_model.php

public function verify_login($username, $password)
{
        // Your database query to fetch user details based on username
        $query = $this->db->table('super_admins')
        ->where('username', $username)
        ->where('password', md5($password))
        ->where('status',1)
        ->get();
---
SELECT *
FROM `super_admins`
WHERE `username` = 'room.jaywant'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'
AND `status` = 1