app/Models/Notification_model.php

  public function check_list_admin_user_admin_request_superadmin($admin_id)
  {
  	$builder = $this->db->table("notification");
    $builder->join('super_admins', 'super_admins.id = notification.notification_from_id');
    $builder->join('tbl_admin_request_balace_super_admin', 'tbl_admin_request_balace_super_admin.request_id = notification.request_id');
    $builder->where('notification_title', "Balance Amount Extends Request Send Superadmin");
    $builder->where('notification_type', "extend request balance amount");
    $builder->where('notification.notification_status','0');
    $query = $builder->where('notification_to_id', $admin_id)->get();
---
SELECT *
FROM `notification`
JOIN `super_admins` ON `super_admins`.`id` = `notification`.`notification_from_id`
JOIN `tbl_admin_request_balace_super_admin` ON `tbl_admin_request_balace_super_admin`.`request_id` = `notification`.`request_id`
WHERE `notification_title` = 'Balance Amount Extends Request Send Superadmin'
AND `notification_type` = 'extend request balance amount'
AND `notification`.`notification_status` = '0'
AND `notification_to_id` = '69'

  public function superadmin_amount_change_request_status_change($admin_id)
  {
    $builder = $this->db->table("notification");
    $builder->join('super_admins', 'super_admins.id = notification.notification_from_id');
    $builder->join('tbl_admin_request_balace_super_admin', 'tbl_admin_request_balace_super_admin.request_id = notification.request_id');
    $builder->where('notification_title', "Superadmin Change Balance Amount Request Status");
    $builder->where('notification_type', "Superadmin Change Balance Request Status");
    $builder->where('notification.notification_status','0');
    $query = $builder->where('notification_to_id', $admin_id)->get();
---
SELECT *
FROM `notification`
JOIN `super_admins` ON `super_admins`.`id` = `notification`.`notification_from_id`
JOIN `tbl_admin_request_balace_super_admin` ON `tbl_admin_request_balace_super_admin`.`request_id` = `notification`.`request_id`
WHERE `notification_title` = 'Superadmin Change Balance Amount Request Status'
AND `notification_type` = 'Superadmin Change Balance Request Status'
AND `notification`.`notification_status` = '0'
AND `notification_to_id` = '1'