app/Models/SuperAdmin_model.php

    public function verify_login($username, $password) {
        // Your database query to fetch user details based on username
        $query = $this->db->table('super_admins')
                          ->where('username', $username)
                          ->where('password', md5($password))
                          ->get();
---
SELECT *
FROM `super_admins`
WHERE `username` = 'shweta'
AND `password` = 'bd2d7d2550a43b30c87629311ffb93f7'

    public function update_admin_account_details($id,$data)
    {
        $builder = $this->db->table("super_admins");
        $builder->where('id',$id);
        return $builder->update($data);
---
UPDATE `super_admins` SET `username` = 'harshal.shukla', `password` = 'd41d8cd98f00b204e9800998ecf8427e', `amout_given` = '13000', `first_name` = 'Harshals', `last_name` = 'Shukla', `role` = 'user'
WHERE `id` = '70'

    public function get_admin_user_details($id)
    {
         $query = $this->db->table('super_admins')->getWhere(['id' => $id]);
---
SELECT *
FROM `super_admins`
WHERE `id` = '72'

    public function get_all_admins()
    {
        $builder = $this->db->table("super_admins");
        $query= $builder->where('role','admin')->get();;
---
SELECT *
FROM `super_admins`
WHERE `role` = 'admin'

public function get_all_player_users_list($user_id)
{
    $builder = $this->db->table("super_admins");
    $builder->where('added_by', $user_id);
    $query = $builder->where('role', 'user')->get();
    return $query->getResult(); // or $query->getResultArray()
---
SELECT *
FROM `super_admins`
WHERE `added_by` = '69'
AND `role` = 'user'
SELECT *
FROM `super_admins`
WHERE `role` = 'user'

    public function get_user_history()
    {
        // Retrieve the user history from the database
        $query = $this->db->table('super_admins')->select('username, role, current_wallet, amout_given')->get();

        // Return the result as an array
        return $query->getResultArray();
---
SELECT *
FROM `super_admins`
WHERE `role` = 'user'